#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_global_address.jade-initials-ip["my"] will be created
  + resource "google_compute_global_address" "jade-initials-ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "jade-dev-my"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_sql_database.jade-datarepo-initials-db["my"] will be created
  + resource "google_sql_database" "jade-datarepo-initials-db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "jade-postgres-101-987f0c3b501aeabf"
      + name      = "datarepo-my"
      + project   = "broad-jade-dev"
      + self_link = (known after apply)
    }

  # google_sql_database.jade-stairway-initials-db["my"] will be created
  + resource "google_sql_database" "jade-stairway-initials-db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "jade-postgres-101-987f0c3b501aeabf"
      + name      = "stairway-my"
      + project   = "broad-jade-dev"
      + self_link = (known after apply)
    }

  # module.initials-dns-set.google_dns_record_set.set_dns_record["jade-global-my"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-dev"
      + name         = "jade-global-my.datarepo-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # module.initials-dns-set.google_dns_record_set.set_dns_record["jade-my"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-dev"
      + name         = "jade-my.datarepo-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = [
          + "jade-global-my.datarepo-dev.broadinstitute.org.",
        ]
      + ttl          = 300
      + type         = "CNAME"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions to validate TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
